## Terraform Plan Output - dev Environment
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.app_insights.azurerm_application_insights.this has been deleted
  - resource "azurerm_application_insights" "this" {
      - connection_string                     = (sensitive value) -> null
        id                                    = "/subscriptions/d082ec46-cae2-4914-b058-e49b9130f41f/resourceGroups/rg-terraform-dev2/providers/Microsoft.Insights/components/demo-appi1"
      - instrumentation_key                   = (sensitive value) -> null
        name                                  = "demo-appi1"
        tags                                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.app_service.azurerm_linux_web_app.web has been deleted
  - resource "azurerm_linux_web_app" "web" {
      - default_hostname                               = "demowebapp1234.azurewebsites.net" -> null
        id                                             = "/subscriptions/d082ec46-cae2-4914-b058-e49b9130f41f/resourceGroups/rg-terraform-dev2/providers/Microsoft.Web/sites/demowebapp1234"
      - name                                           = "demowebapp1234" -> null
        tags                                           = {}
        # (22 unchanged attributes hidden)

      - identity {
          - principal_id = "a9794d0e-2af5-4b57-85f8-0bae1464dfa5" -> null
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.app_service.azurerm_service_plan.plan has been deleted
  - resource "azurerm_service_plan" "plan" {
      - id                              = "/subscriptions/d082ec46-cae2-4914-b058-e49b9130f41f/resourceGroups/rg-terraform-dev2/providers/Microsoft.Web/serverFarms/demoaspplan" -> null
        name                            = "demoaspplan"
        tags                            = {}
        # (11 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault.this has been deleted
  - resource "azurerm_key_vault" "this" {
      - id                              = "/subscriptions/d082ec46-cae2-4914-b058-e49b9130f41f/resourceGroups/rg-terraform-dev2/providers/Microsoft.KeyVault/vaults/demokv12345" -> null
      - name                            = "demokv12345" -> null
        tags                            = {
            "environment" = "dev"
            "owner"       = "platform-team"
        }
      - vault_uri                       = "https://demokv12345.vault.azure.net/" -> null
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.log_analytics.azurerm_log_analytics_workspace.this has been deleted
  - resource "azurerm_log_analytics_workspace" "this" {
      - id                                      = "/subscriptions/d082ec46-cae2-4914-b058-e49b9130f41f/resourceGroups/rg-terraform-dev2/providers/Microsoft.OperationalInsights/workspaces/demolog2" -> null
      - name                                    = "demolog2" -> null
        tags                                    = {}
        # (15 unchanged attributes hidden)
    }

  # module.rg.azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/d082ec46-cae2-4914-b058-e49b9130f41f/resourceGroups/rg-terraform-dev2"
      - name     = "rg-terraform-dev2" -> null
        tags     = {
            "environment" = "dev"
            "owner"       = "platform-team"
        }
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "eastus2"
      + name                                = "demo-appi1"
      + resource_group_name                 = "rg-terraform-dev2"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # module.app_service.azurerm_linux_web_app.web will be created
  + resource "azurerm_linux_web_app" "web" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus2"
      + name                                           = "demowebapp1234"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-terraform-dev2"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version = "8.0"
            }
        }
    }

  # module.app_service.azurerm_service_plan.plan will be created
  + resource "azurerm_service_plan" "plan" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "eastus2"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "demoaspplan"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-terraform-dev2"
      + sku_name                        = "P1v3"
      + worker_count                    = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "eastus2"
      + name                          = "demokv12345"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = (known after apply)
      + resource_group_name           = "rg-terraform-dev2"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 14
      + tags                          = {
          + "environment" = "dev"
          + "owner"       = "platform-team"
        }
      + tenant_id                     = "4f06e6e8-ae4a-4b64-882a-792a2a921809"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.log_analytics.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "eastus2"
      + name                            = "demolog2"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-terraform-dev2"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.rg.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "rg-terraform-dev2"
      + tags     = {
          + "environment" = "dev"
          + "owner"       = "platform-team"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>